app/controllers/articles_controller.rb

  def update
    # raise params.inspect -> shows params hash in an error message in browser
    # raise params.inspect

    #Query the database for Article record that matches the :id passed to the route.
     #Store query in instance variable
    @article = Article.find(params[:id])

    #Update the values passed from the form. The update method takes a hash of the attributes for the model as its argument.
    # Save changes to the database
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-08-31 02:14:43.661006"], ["id", 1]]